[
    {
      "job_title": "Software Engineer",
      "job_description": "Responsible for designing, developing, and maintaining software applications. Collaborates with team members to deliver high-quality software solutions.",
      "requirements": [
        "Bachelor's degree in Computer Science or related field",
        "Proficiency in programming languages such as Java, Python, or JavaScript",
        "Experience with software development methodologies like Agile",
        "Strong problem-solving skills"
      ]
    },
    {
      "job_title": "Marketing Manager",
      "job_description": "Leads the marketing team in developing and implementing marketing strategies to promote the company's products or services. Analyzes market trends and customer behavior to identify opportunities for growth.",
      "requirements": [
        "Bachelor's degree in Marketing, Business Administration, or related field",
        "Proven experience in marketing management",
        "Excellent communication and interpersonal skills",
        "Ability to analyze data and make strategic decisions"
      ]
    },
    {
      "job_title": "Financial Analyst",
      "job_description": "Analyzes financial data, prepares reports, and provides insights to support decision-making processes. Conducts financial modeling and forecasting to assess performance and identify risks and opportunities.",
      "requirements": [
        "Bachelor's degree in Finance, Accounting, or related field",
        "Strong analytical and quantitative skills",
        "Proficiency in financial analysis tools and software",
        "Attention to detail and accuracy"
      ]
    },
    {
      "job_title": "Customer Support Specialist",
      "job_description": "Provides assistance to customers, resolves inquiries, and ensures customer satisfaction. Handles incoming calls, emails, and live chat interactions. Collaborates with other teams to address customer issues.",
      "requirements": [
        "High school diploma or equivalent",
        "Excellent communication and problem-solving skills",
        "Patience and empathy in dealing with customers",
        "Ability to work in a fast-paced environment"
      ]
    },
    {
      "job_title": "Graphic Designer",
      "job_description": "Creates visual concepts and designs for various projects, including advertisements, websites, and branding materials. Collaborates with clients and team members to develop creative solutions that meet project requirements.",
      "requirements": [
        "Bachelor's degree in Graphic Design or related field",
        "Proficiency in design software such as Adobe Creative Suite",
        "Strong portfolio showcasing creative work",
        "Ability to work under tight deadlines"
      ]
    },
    {
      "job_title": "Human Resources Manager",
      "job_description": "Oversees all aspects of human resources functions, including recruitment, employee relations, training, and benefits administration. Develops and implements HR policies and procedures to support organizational goals.",
      "requirements": [
        "Bachelor's degree in Human Resources, Business Administration, or related field",
        "Proven experience in HR management",
        "Strong understanding of employment laws and regulations",
        "Excellent leadership and interpersonal skills"
      ]
    },
    {
      "job_title": "Sales Representative",
      "job_description": "Identifies and develops new business opportunities, builds relationships with customers, and achieves sales targets. Provides product demonstrations, negotiates contracts, and maintains accurate sales records.",
      "requirements": [
        "High school diploma or equivalent (Bachelor's degree preferred)",
        "Proven experience in sales or customer service",
        "Excellent communication and negotiation skills",
        "Ability to work independently and as part of a team"
      ]
    },
    {
      "job_title": "Data Scientist",
      "job_description": "Analyzes complex datasets, develops machine learning models, and provides actionable insights to drive business decisions. Collaborates with cross-functional teams to identify opportunities for data-driven solutions.",
      "requirements": [
        "Master's degree or PhD in Computer Science, Statistics, or related field",
        "Proficiency in programming languages such as Python or R",
        "Experience with data analysis and machine learning techniques",
        "Strong problem-solving and critical thinking skills"
      ]
    },
    {
      "job_title": "Operations Manager",
      "job_description": "Oversees day-to-day operations, including production, logistics, inventory management, and quality control. Develops and implements operational strategies to improve efficiency and reduce costs.",
      "requirements": [
        "Bachelor's degree in Business Administration, Operations Management, or related field",
        "Proven experience in operations management",
        "Strong leadership and decision-making skills",
        "Ability to manage multiple projects and priorities"
      ]
    },
    {
      "job_title": "Content Writer",
      "job_description": "Creates engaging and informative content for websites, blogs, social media, and other digital platforms. Conducts research, develops content strategies, and ensures content is aligned with brand voice and target audience.",
      "requirements": [
        "Bachelor's degree in English, Journalism, Communications, or related field",
        "Proven experience in content writing or copywriting",
        "Excellent writing and editing skills",
        "Ability to work under tight deadlines and adapt to changing requirements"
      ]
    }
  ]
  